{
  "main": {
    "name": "Gurnish Singh",
    "description": "I am a web development engineer and I use react and vue.js to develop pages. This project is a resume template that can be used as the project home page or resume page",
    "bio": "Hey, I’m Gurnish Singh — a code-slinging, bug-busting software developer. By day, I crush software testing like a certified pro. By passion, I craft slick web apps and architect cloud-powered solutions that actually scale.\n\nI speak fluent Java, C++, and JavaScript — and I know how to make each of them behave (well, most days). Whether it's spinning up microservices or hacking on side projects, I'm all about pushing boundaries and building stuff that actually matters.\n",
    "contactmessage": "Welcome! I'm excited to connect with you. Whether you have a question, an idea, or just want to chat, feel free to contact me anytime. I'm here to listen, offer support, and provide information whenever possible. Let's start a conversation and see where it takes us! You can reach out to me through the links below. Looking forward to hearing from you soon!",
    "email": "gurnish3956@gmail.com",
    "phone": "+91 9877619424",
    "github": "https://github.com/gurnish-singh",
    "project": "https://github.com/nordicgiant2/react-nice-resume",
    "address": {
      "street": "Agar Nagar Near Bus Stand",
      "city": "Malerkotla",
      "state": "Punjab ",
      "zip": "148023"
    },
    "website": "http://www.timbakerdev.com",
    "resumeDownload": "https://drive.google.com/file/d/1H7PTJiJrycwg95aVaB4XZFg6XvkA2n1d/view?usp=sharing",
    "social": [
      {
        "name": "mail",
        "url": "mailto:gurnishsinghji@gmail.com",
        "className": "fab fa-envelope fa-3x"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/gurnish-singh/",
        "className": "fab fa-linkedin fa-3x"
      },
      {
        "name": "github",
        "url": "https://github.com/gurnish-singh",
        "className": "fab fa-github fa-3x"
      },
      {
        "name": "leetcode",
        "url": "https://leetcode.com/gurnish-singh",
        "className": "fa-solid fa-code fa-3x"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/gurnish__singh",
        "className": "fab fa-twitter fa-3x"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/gurnish1708/",
        "className": "fab fa-instagram fa-3x"
      },
      {
        "name": "medium",
        "url": "https://medium.com/@gurnish-singh",
        "className": "fab fa-medium fa-3x"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "Thapar Institute of Engineering anf Technology",
        "degree": "Bachelors in Electronics and Computer Science CGPA:8.43",
        "graduated": "June 2021",
        "description": "I pursued computer science engineering at Thapar Institute of Engineering and Technology, where I gained confidence in complex programming languages and data structures. Throughout my degree, I worked on various projects, both individually and in groups, which helped me apply my knowledge in real-world situations. Graduating with honors, I landed a job as a software engineer at a top tech company, grateful for the education and experiences that prepared me for the challenges and opportunities ahead."
      }
    ],
    "work": [
      {
        "company": "Samsung SDS",
        "title": "Assistant Manager(SDE-II)",
        "years": "July 2023 - Present",
        "description": "• Contributed to SingleID, a platform providing unified, secure access across web, mobile, and SaaS applications, used by over 100,000 Samsung employees. Focused on front-end development with Vue.js, collaborating with the team to enhance user experience and interface functionality."
      },
      {
        "company": "Samsung SDS",
        "title": "Senior Executive(SDE-I)",
        "years": "July 2021 - June 2023",
        "description": "• Participated in enhancing Samsung’s IDE Analyzer by merging REDCA static and dynamic analysis into a unified platform. Implemented interactive data visualizations (graphs and tables) for analysis results using full-stack technologies. This critical tool is leveraged by nearly all Samsung developers for every pull request, significantly improving code quality and reviewefficiency.\n• Developed front-end features for the FDCA mobile app using React Native, supporting digital transformation in the financial sector. The app is used by hundreds of insurance agents who manage policies and interact with thousands of customers."
      }
    ]
  }
}
